Tekla.Structures.Drawing.Part
The Part class contains methods related to parts.
A part is a drawing object derived from a model object.
It represents a drawing part that has a reference to the
actual part in the model database.

Tekla.Structures.Drawing.Part.Attributes
The attributes of the part.
For more information see Tekla.Structures.Drawing.Part.PartAttributes.

Tekla.Structures.Drawing.Part.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Part.#ctor
Create instance of Part

Tekla.Structures.Drawing.Part.#ctor(System.Boolean)
Create instance of Part

Tekla.Structures.Drawing.Part.Delete
Calls the system to delete the object.
Returns: True on success.

Tekla.Structures.Drawing.Part.Modify
Calls the system to update/modify the object.
Returns: True on success.

Tekla.Structures.Drawing.Part.Insert
NOT YET IMPLEMENTED.
Returns: False.

Tekla.Structures.Drawing.Part.Select
Calls the system to select and retrieve the object.
Returns: True on success.